app/views/static_pages/perfomance_answer.html.erb

		<% @answers.each do |a|%>
			<p>Avaliador: <%= User.find(a.userLogged).email %> </p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 30]]