app/views/static_pages/perfomance_evaluation.html.erb

SELECT "dimensions".* FROM "dimensions" WHERE "dimensions"."perfomance_id" IN (1)
---
                <div id="wrapper-form">
                  <% @perfomance.dimensions.each do |dimension| %>

SELECT "questions".* FROM "questions" WHERE "questions"."dimension_id" = $1  [["dimension_id", 1]]
---
                      <tbody>
                        <% dimension.questions.each do |question| %>