app/views/areas/_form.html.erb

SELECT "areas".* FROM "areas"
---
    <%= f.label :subarea_id %><br>
    <%= f.select :subarea_id, Area.all.collect { |a| [ a.name, a.id ] } %>