app/controllers/areas_controller.rb

SELECT "areas".* FROM "areas"
---
  def index
    #@areas = Area.all
    @areas = Area.includes(:subarea).all

SELECT "organograms".* FROM "organograms"
---
  def new
    @area = Area.new
    @organograms = Organogram.all

SELECT "organograms".* FROM "organograms"
---
  def edit
    @organograms = Organogram.all

INSERT INTO "areas" ("organogram_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["organogram_id", 1], ["name", "TI"], ["created_at", "2015-11-23 22:05:47.645057"], ["updated_at", "2015-11-23 22:05:47.645057"]]
---
  def create
    @area = Area.new(area_params)

    respond_to do |format|
      if @area.save

SELECT  "areas".* FROM "areas" WHERE "areas"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_area
      @area = Area.find(params[:id])