app/controllers/organograms_controller.rb

SELECT "organograms".* FROM "organograms"
---
  def index
    @organograms = Organogram.all

SELECT "federations".* FROM "federations"
SELECT "junior_companies".* FROM "junior_companies"
---
  def new
    @organogram = Organogram.new
    @federations = Federation.all
    @juniorCompanies = JuniorCompany.all

INSERT INTO "organograms" ("federation_id", "date_initial", "date_final", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["federation_id", 1], ["date_initial", "2015-01-01"], ["date_final", "2015-12-31"], ["created_at", "2015-11-23 22:05:24.764550"], ["updated_at", "2015-11-23 22:05:24.764550"]]
---
  def create
    @organogram = Organogram.new(organogram_params)

    respond_to do |format|
      if @organogram.save

SELECT  "organograms".* FROM "organograms" WHERE "organograms"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_organogram
      @organogram = Organogram.find(params[:id])