app/controllers/static_pages_controller.rb

SELECT *, DISTINCT ON (dimension_id) sum(value) as soma FROM "perfomance_answers" WHERE (value is not null) GROUP BY id,dimension_id  ORDER BY dimension_id
---
  def perfomance_result
    @answers = PerfomanceAnswer.all

SELECT "perfomance_answers".* FROM "perfomance_answers"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 30]]
---
  def perfomance_answer
    @answers = PerfomanceAnswer.all
    @answers.each do |a|
      @users = User.find(a.userLogged)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 30]]
---
    #percorre o array de usuários que tenho que avaliar
    arrUserIdMaybeEvaluated.each do |userIdMayBeEvaluated|
      #recupera o usuário que tem que ser avaliado
      user = User.find(userIdMayBeEvaluated)

SELECT "perfomance_answers".* FROM "perfomance_answers" WHERE "perfomance_answers"."userLogged" = $1  [["userLogged", 30]]
---
    userPerfomanceAnswer = Hash.new

    #pesquisando todas as avaliações do usuário
    perfomanceAnswer = PerfomanceAnswer.where(userLogged: userId)

SELECT "dimensions".* FROM "dimensions" WHERE "dimensions"."perfomance_id" IN (1)
SELECT "questions".* FROM "questions" WHERE "questions"."dimension_id" = $1  [["dimension_id", 1]]
---

      if pa.value != nil
        key = "cb_#{pa.user_id}_#{pa.perfomance_id}_#{pa.dimension_id}_#{pa.question_id}"
        userPerfomanceAnswer[key] = pa.value

SELECT  "perfomances".* FROM "perfomances" WHERE "perfomances"."role_id" = $1  ORDER BY "perfomances"."id" ASC LIMIT 1  [["role_id", 1]]
---


    #recuperando a avaliação de desempenho baseado no cargo
    @perfomance = Perfomance.includes(:dimensions).where(role_id: roleId).first

SELECT  "perfomance_answers".* FROM "perfomance_answers" WHERE "perfomance_answers"."userLogged" = $1 AND "perfomance_answers"."user_id" = $2 AND "perfomance_answers"."perfomance_id" = $3 AND "perfomance_answers"."dimension_id" = $4 AND "perfomance_answers"."question_id" = $5  ORDER BY "perfomance_answers"."id" ASC LIMIT 1  [["userLogged", 30], ["user_id", 30], ["perfomance_id", 3], ["dimension_id", 17], ["question_id", 67]]
---
  def ajax_perfomance_user_save

    #id do usuário avaliador
    userIdLogged = current_user.id
    #id do usuário avaliado
    userId = params[:ajaxUserId]
    #avaliação de desempenho
    perfomanceId = params[:ajaxPerfomanceId]
    #dimensao
    dimensionId = params[:ajaxDimensionId]
    #questão
    questionId = params[:ajaxQuestionId]
    #valor da pergunta
    value = params[:ajaxValue]
    #feedback
    text = params[:ajaxText]


    #verifica se já existe uma resposta para pergunta enviada
    answerExists = nil

    #ele esta enviando um feedback?
    if value == nil
      PerfomanceAnswer.where(
        userLogged: userIdLogged,
        user_id: userId,
        perfomance_id: perfomanceId,
        dimension_id: dimensionId,
        ).first
    else
      PerfomanceAnswer.where(
        userLogged: userIdLogged,
        user_id: userId,
        perfomance_id: perfomanceId,
        dimension_id: dimensionId,
        question_id: questionId
        ).first

INSERT INTO "perfomance_answers" ("userLogged", "user_id", "perfomance_id", "dimension_id", "question_id", "value", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    #existe uma resposta?
    if answerExists == nil
      #criando o registro
      registry = PerfomanceAnswer.create({
        userLogged: userIdLogged,
        user_id: userId,
        perfomance_id: perfomanceId,
        dimension_id: dimensionId,
        question_id: questionId,
        value: value,
        text: text})